class PsyhoTest
  def initialize
    @questions = [
      "Вам предстоит ординарная или деловая встреча. Выбивает ли Вас ее ожидание из колеи?",

      "Вызывает ли у Вас смятение и неудовольствие поручение выступить с докладом, сообщением, \n" +
      "информацией на каком-либо совещании, собрании или тому подобном мероприятии? ",

      "Не откладываете ли Вы визит к врачу до последнего момента?",

      "Вам предлагают выехать в командировку в город, где Вы никогда не бывали. Приложите ли \n" +
      "Вы максимум усилий, чтобы избежать этой командировки?",

      "Любите ли Вы делиться своими переживаниями с кем бы то ни было?",

      "Раздражаетесь ли Вы, если незнакомый человек на улице обратится к Вам с просьбой (показать \n" +
      "дорогу, назвать время, ответить на какой-то вопрос)?",

      "Верите ли Вы, что существует проблема <<отцов и детей>> и что людям разных поколений трудно понимать друг друга?",

      "Постесняетесь ли Вы напомнить знакомому, что он забыл Вам вернуть деньги, которые занял несколько месяцев назад?",

      "В ресторане либо в столовой Вам подали явно недоброкачественное блюдо. Промолчите ли Вы, лишь рассерженно отодвинув тарелку? ",

      "Оказавшись один на один с незнакомым человеком, Вы не вступите с ним в беседу и будете тяготиться, \n" +
      "если первым заговорит он. Так ли это?",

      "Вас приводит в ужас любая длинная очередь, где бы она ни была (в магазине, библиотеке, кассе кинотеатра).\n" +
      "Предпочитаете ли Вы отказаться от своего намерения или встанете в хвост и будете томиться в ожидании? ",

      "Боитесь ли Вы участвовать в какой-либо комиссии по рассмотрению конфликтных ситуаций?",

      "У Вас есть собственные сугубо индивидуальные критерии оценки произведений литературы, искусства, культуры \n" +
      "и никаких чужих мнений на этот счет Вы не приемлете. Это так?",

      "Услышав где-либо в кулуарах высказывание явно ошибочной точки зрения по хорошо известному Вам вопросу, \n"+
      "предпочитаете ли Вы промолчать и не вступать в разговор?",

      "Вызывает ли у Вас досаду чья-либо просьба помочь разобраться в том или ином служебном вопросе или учебной теме?",

      "Охотнее ли Вы излагаете свою точку зрения (мнение, оценку) в письменной форме, чем в устной?"
    ]
    #очки за ответы на вопросы
    @psyho_score = 0
    #текущий вопрос
    @current_question = 0
  end

  def finished?
    return @current_question >= @questions.size
  end

  def next_question
    user_input = 0
    puts @questions[@current_question]
    #проверка корректности ввода и требование корректного ввода при неправильном
    until user_input.between?(1, 3)
      puts "Введите 3, 2 или 1"
      user_input = gets.to_i
    end
    #вычитаем один так как нам нужно что бы складывались 2, 1 и 0 очков
    @psyho_score += user_input - 1
    #итерируем @current_question для перехода к следущему вопросу
    @current_question += 1
  end
  
  def psyho_score
    return @psyho_score
  end
end

